CSI API ETABS v1
cHelper.CreateObjectProgID Method
 Starts the program and returns the API object for the given program ID.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cOAPI CreateObjectProgID(
	string progID
)
Function CreateObjectProgID (
	progID As String
) As cOAPI
Dim instance As cHelper
Dim progID As String
Dim returnValue As cOAPI
returnValue = instance.CreateObjectProgID(progID)
cOAPI^ CreateObjectProgID(
	String^ progID
)
abstract CreateObjectProgID :
        progID : string -> cOAPI
Parameters
progID
Type: System.String
The program ID of the API object.
Return Value
Type: cOAPI
An instance of cOAPI if successful, nothing otherwise.
Remarks
Searches the registry for the newest version unless overridden with an environment variable containing the full path of the API object's assembly. The overriding environment variable is found by replacing the "."s with "_" in the program id and appending "_PATH". e.g. the environment variable of "CSI.ETABS.API.ETABSObject" is "CSI_ETABS_API_ETABSObject_PATH".
Examples
Public Sub Example()
    Dim myHelper As cHelper
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    myHelper = New Helper
    EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
    'start ETABS application
    ret = EtabsObject.ApplicationStart()
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
    myHelper = Nothing
End Sub
See Also
Reference
cHelper Interface
ETABSv1 Namespace